site/src/main/webapp/jekyll/_posts/2012-05-29-artifactory.html
---
layout: post
title: Artifactory
tags: [maven, artifactory, dependency management, build tools]
excerpt: How to set up your own private Maven Repository using Artifactory
---

<p>
Artifactory is a Maven repository Manager that provides a ton of
useful features out of the box. 
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Steps </h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">Download Artifactory </h3>
<div class="outline-text-3" id="text-1.1">


<p>
wget <a href="http://downloads.sourceforge.net/project/artifactory/artifactory/2.5.2/artifactory-2.5.2.zip">http://downloads.sourceforge.net/project/artifactory/artifactory/2.5.2/artifactory-2.5.2.zip</a>
unzip artifactory.zip &amp;&amp; rm artifactory.zip
</p>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">Install locally </h3>
<div class="outline-text-3" id="text-1.2">

</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3">Start and verifiy installation </h3>
<div class="outline-text-3" id="text-1.3">

</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4">Install on remote server </h3>
<div class="outline-text-3" id="text-1.4">

</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5">Setup project to resolve dependencies from artifactory </h3>
<div class="outline-text-3" id="text-1.5">

</div>

</div>

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6">Setup project to deploy artifacts to artifactory </h3>
<div class="outline-text-3" id="text-1.6">

</div>

</div>

<div id="outline-container-1.7" class="outline-3">
<h3 id="sec-1.7">Setup project to resolve plugin dependencies from artifactory </h3>
<div class="outline-text-3" id="text-1.7">

</div>

</div>

<div id="outline-container-1.8" class="outline-3">
<h3 id="sec-1.8">(optionally) setup project to use local version </h3>
<div class="outline-text-3" id="text-1.8">


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Repository Manager vs "Rolling Your Own" Custom Maven Repo </h2>
<div class="outline-text-2" id="text-2">


<ul>
<li>
Repo Managers act as Proxies to the Central Repo. 
If your repo manager is installed on a local network (or I even have artifactory installed locall)
then it can really speed up build times. 
</li>
<li>
GUI's provide easier ways to manage depenedencies
</li>
<li>
Automatic management of snapshot verses stable versions of artifacts
</li>
<li>
Greater control over exactly which dependencies are used in your project. 

</li>
</ul>
</div>
</div>
